# -*- coding: utf-8 -*-
__author__ = 'Dragon'



EXCLUSIVES = [u'领型', u'面料', u'袖款', u'袖长', u'腰型', u'厚薄', u"扣型"]


IMPORTANT_ATTR_ENUM = {
    'mp_women_clothing':{
        'name':[[u"羽绒服",u"棉衣/棉服"],
            [u"休闲裤",u"西装裤/正装裤",u"打底裤"],
            [u"牛仔裤"],
            [u"风衣",u"毛呢外套",u"短外套",u"皮草",u"西装",u"皮衣",u"西装套装",u"时尚套装"],
            [u"T恤",u"长袖",u"衬衫",u"背心吊带",u"蕾丝衫/雪纺衫",u"POLO衫",u"马夹"],
            [u"卫衣/绒衫",u"毛衣",u"毛针织衫"],[u"短裙",u"连衣裙",u"长裙",u"半身裙"]
        ],
        'value':[
            [u"版型",u"廓形",u"衣门襟",u"图案",u"衣长",u"袖型",u"腰型",u"fun"],
            [u"版型", u"裤型", u"面料", u"裤长", u"腰型"],
            [u"版型", u"裤型", u"面料", u"裤长", u"腰型", u"做工工艺"],
            [u"版型",u"廓形",u"面料",u"图案",u"衣长",u"袖型",u"腰型"],
            [u"版型",u"廓形",u"面料",u"图案",u"风格",u"颜色"],
            [u"版型",u"廓形",u"面料",u"图案",u"袖型",u"风格",u"颜色"],
            [u"版型",u"廓形",u"面料",u"图案",u"裙型",u"袖型"]
        ]
    }
}
